chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz2048ecg124.h
PLIB_INLINE_API void PLIB_TMR_ClockSourceSelect(TMR_MODULE_ID index, TMR_CLOCK_SOURCE source)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_2 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_4 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_6 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_8 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_3 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_5 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_7 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_9 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsClockSource(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_6 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_8 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_7 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_9 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_PrescaleSelect(TMR_MODULE_ID index, TMR_PRESCALE prescale)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_2 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_4 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_6 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_8 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_3 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_5 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_7 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_9 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_TMR_PrescaleGet(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_2 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_4 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_6 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_8 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_3 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_5 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_7 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_9 :
            return TMR_PrescaleGet_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsPrescale(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_6 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_8 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_7 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_9 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_ClockSourceExternalSyncEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_ClockSourceExternalSyncEnable_Inverted(index);
            break;
        case TMR_ID_2 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_4 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_6 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_8 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_3 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_7 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_9 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_TMR_ClockSourceExternalSyncDisable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_ClockSourceExternalSyncDisable_Inverted(index);
            break;
        case TMR_ID_2 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_4 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_6 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_8 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_3 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_7 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_9 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsClockSourceSync(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsClockSourceSync_Inverted(index);
        case TMR_ID_2 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_4 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_6 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_8 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_3 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_7 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_9 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

